Repository: magi1125/inclusive-design-pattern
Catalog: tm/chapter-19_EN-US_JA.tmx
Source language: en_us
Languages: ja

source: Inclusive Prototyping
ja: インクルーシブなプロトタイプ制作

source: This book offers a number of preconceived solutions to certain problems, approached with inclusion in mind.
ja: 本書では、特定の問題に対する、インクルージョンを念頭に置いた既存の解決策を数多く紹介します。

source: Though you’re likely to use some as presented (like the navigation region pattern) across many of your projects, they’re really just examples.
ja: 皆さんはそのうちのいくつか（ナビゲーション領域のパターンなど）を実際のプロジェクトの多くで使う可能性が高いでしょうが、それらはただの例にすぎません。

source: They’re here to help you practice thinking inclusively as you formulate your own patterns to solve your own design problems.
ja: ここで紹介する解決策は、皆さんがデザインの問題に直面し、それを解決する独自のパターンを考案する際に、インクルージョンを意識して考える訓練をするためのものです。

source: It’s investing this thought in the early stages of the design process that leads to a robust product.
ja: そうした考え方をデザインプロセスの早い段階から持つことが、堅牢な結果につながるのです。

source: Drawing on what we learn about our potential audience in the discovery phase1 of our project, we begin to think about what tasks our app will allow users to perform.
ja: プロジェクトの発見の段階（脚注126）で潜在的な閲覧者について学んだことを利用して、ユーザーがどのようなことを実行できるアプリケーションにするかを考え始めます。

source: In essence, we begin to stockpile verbs: create, sort, edit, buy, read, respond, move, capture, draw, upload.
ja: 要するに、作成する、ソートする、編集する、購入する、読む、答える、動かす、キャプチャーする、描く、アップロードするといった動詞を蓄積していきます。

source: It’s imperative we think first about how these actions might be taken rather than how the experience might look and feel.
ja: まずは、ルックアンドフィールなどよりも、こうしたアクションがどのように行われるかについて考えることが必要不可欠です。

source: Thinking about aesthetics and delight is far too high-level at this stage.
ja: 見た目の美しさや楽しみについて考えるのは、この段階ではまだレベルが高すぎます。

source: We need to prototype for usability, and the more inclusive the prototyping experience, the more people will find the product usable.
ja: ユーザビリティに焦点を当てたプロトタイプ制作を行う必要があり、プロトタイプの体験がインクルーシブなほど、より多くの人がプロダクトを使いやすいと感じます。

source: Paper Prototyping
ja: ペーパープロトタイピング

source: Almost all of the successful projects I’ve worked on as a designer and developer have included interactive paper prototyping in the early stages of the design process.
ja: 私がこれまでデザイナーおよび開発者として取り組んで良い結果を収めたほぼすべてのプロジェクトでは、デザインプロセスの早い段階でインタラクティブなペーパープロトタイピングを行いました。

source: For example, the Great British Public Toilet Map2 started out with me drawing and cutting out pictures of toilets in the offices of Neontribe3.
ja: たとえば、Great British Public Toilet Map（脚注127）のプロジェクトでは、まずNeontribe社（脚注128）のオフィスにあるトイレの絵を描いて切り抜くことから始めました。

source: Not to be confused with sketching, paper prototyping is about creating an interactive prototype from paper, which — with the help of someone to manually operate it — allows user testers to play with a rough-and-ready demo version of the candidate app.
ja: スケッチと混同しないように説明しますが、ペーパープロトタイピングでは、紙を使ってインタラクティブなプロトタイプを作成します。これを手で操作することで、ユーザーテスターにテスト対象のアプリケーションの即席デモをあれこれと試してもらうのです。

source: There are a number of advantages to paper prototyping over high fidelity and code-based demos.
ja: ペーパープロトタイピングには、忠実度の高いコードベースのデモよりも優れている点がいくつもあります。

source: •Most anyone can work with paper. Coded prototypes require some skill in front-end development.
ja: • 何よりも、紙ならだれでも扱える。コード化されたプロトタイプには、フロントエンド開発のスキルがいくらか必要になります。

source: Committing to work with paper means other team members, including back-end developers and others not confident in their design skills, can have a try.
ja: 紙を使えば、バックエンド開発者やデザインスキルに自身のない人といった他のチームメンバーも試すことができます。

source: Importantly, it also means stakeholders and test users can be included in iteration.
ja: 重要なのは、関係者やテストユーザーもイテレーションに参加できる点です。

source: •It’s easy to iterate. Paper prototypes are mostly just pen on paper, held together with sticky tack.
ja: • イテレーションが容易。ペーパープロトタイプの多くは、ペンで紙に描いたものを？？粘着ラバー？？で1つにまとめてあるだけです。【コメント：訳語に問題ないかご確認ください。複数あります。初出のみ？？を付けました。原文「sticky tack」】

source: By using sticky tack to piece components together, it’s easy to move parts around.
ja: 粘着ラバーを使って各構成要素をつなぎ合わせているので、パーツは簡単に移動できます。

source: If you want new parts, just get out some spare bits of paper and your marker pens.
ja: 新しいパーツが必要になったら、小さな紙とペンを取り出すだけ。

source: This can be done during test sessions and can involve everyone present — infinitely preferable to sitting around twiddling thumbs while a front-end dev fiddles anxiously with their laptop.
ja: これならテストセッション中に作業でき、その場にいる誰もが手伝えます。フロントエンド開発者がノートPCを気遣わしげに操作する様子を手持ち無沙汰で待っているよりずっとましです。

source: •It’s not polished. The trouble with high-fidelity mockups and prototypes is that they tend to look finished.
ja: • 完成度が低い。忠実度の高いモックアップやプロトタイプの問題点は、完成したように見えることです。

source: People are polite and you won’t get honest feedback about something that looks like it’s had a lot of work put into it.
ja: 人は礼儀をわきまえているので、多大な労力をかけたように見えるものに対する率直な感想を聞き出すのは難しいでしょう。

source: That it’s made of paper at all means it’s clearly only an allegory of the real app, so feedback about aesthetic particulars is kept to a minimum.
ja: また、紙で作られていれば、本物のアプリケーションの例示品にすぎないことが明らかなので、見た目の美しさに関するフィードバックを最小限に抑えられます。

source: Focus remains on whether the idea solves the problem well.
ja: 焦点が、そのアイデアで問題がうまく解決できるかどうかからずれません。

source: What You Will Need
ja: 必要なもの

source: Let’s imagine you’re embarking on a paper prototype.
ja: ペーパープロトタイピングに着手することになったとしましょう。

source: First, we’ll take care of what you need in terms of equipment and why.
ja: まずは、必要な道具と、その理由について説明します。

source: •Large pieces of paper (preferably A2)
ja: • 大判の紙（A2を推奨）

source: •Scissors
ja: • ハサミ

source: •Sticky tack
ja: • 粘着ラバー

source: •Permanent marker pens
ja: • 耐水性マーカー

source: •Sheets of acetate
ja: • ？？アセテートフィルム？？【コメント：訳語に問題ないかご確認ください。複数あります。初出のみ？？を付けました。原文「Sheets of acetate」または「acetate」】

source: •A dry-wipe (whiteboard-style) pen
ja: • ？？ホワイトボード用のペン？？【コメント：訳語に問題ないかご確認ください。複数あります。初出のみ？？を付けました。原文「A dry-wipe (whiteboard-style) pen」または「dry-wipe pen」】

source: Large Pieces of Paper
ja: 大判の紙

source: Whether your prototype is intended to demo an app for small handheld devices or large installation screens, it’s better to begin large.
ja: プロトタイプでデモを行おうとしているアプリケーションが、小さい携帯端末用でも、大型の設置型スクリーン用でも、最初は大きく作ることをお勧めします。

source: A large viewport (paper sheet to which smaller parts of the paper app are adhered) means more people in your test environment can simultaneously see it as it is being used.
ja: 大きいビューポート（紙製アプリケーションの小さいパーツを貼り付ける紙面）なら、テストの場にいる多くの人が、アプリケーションが使用されている様子を同時に見ることができます。

source: That means everyone can feel involved, and more and better notes can be taken.
ja: 全員が参加しているように感じることができ、より多くのことにじっくりと注意を払うことができます。

source: Obviously, you’ll need a table big enough to sit the prototype on!
ja: 当然ながら、プロトタイプを置く広いテーブルも必要になります。

source: Scissors
ja: ハサミ

source: Just like a real app, the viewport will be divided into smaller sections or components.
ja: 本物のアプリケーションと同じように、ビューポートを小さいセクションやコンポーネントに分けます。

source: You’ll need to cut some of your larger sheets into smaller ones to be placed on top of the base sheet.
ja: 何枚かの大判の紙を小さく切って、台紙の上に配置する必要が出てくるでしょう。

source: If you have a guillotine handy all the better, but don’t worry too much about all the lines being parallel.
ja: 裁断機が手元にあればさらに良いですが、すべての線がきっちり平行でなくても大丈夫です。

source: The wonkier the prototype looks (within reason!), the less intimidating and more approachable it is.
ja: 少しいびつなプロトタイプほど（ただし妥当な範囲内で！）、敷居が低くてとっつきやすくなります。

source: Sticky Tack
ja: 粘着ラバー

source: Sticky tack is what makes the paper app modular and lets you quickly move components around, either as part of the app’s operation or as part of layout iteration.
ja: 粘着ラバーを使えば、紙のアプリケーションがモジュール式になるので、コンポーネントをすばやく移動して、アプリケーションの操作を検討したり、レイアウトのイテレーションを行えます。

source: Whenever a part of a component is liable to be moved or replaced, use a separate piece of paper and stick it in place with tack.
ja: コンポーネントの一部を動かしたり置き換えたりする可能性がある場合は、個別の紙片を使って、粘着ラバーで適所に貼り付けましょう。

source: Permanent Marker Pens
ja: 耐水性マーカー

source: Of course, you’ll need to write labels, draw borders around buttons and make various other markings, so some pens are essential.
ja: 当然ですが、ラベルを書いたり、ボタンの輪郭線を引いたり、さまざまな線や印などを描き込む必要があるので、ペンが何本か必要です。

source: However, try to limit yourself to just a few colors — this isn’t an art project.
ja: ただし、使う色は絞り込みましょう。これはアートプロジェクトではありません。

source: I usually make sure I have a couple of black pens, then choose a red for errors, green for success messages, and blue for links and buttons.
ja: 私はたいてい、黒のペンを数本用意し、あとはエラー用に赤、成功のメッセージ用に緑、リンクやボタン用に青を使います。

source: Sheets of Acetate
ja: アセテートフィルム

source: If you’re making an app, there are probably going to be some input fields.
ja: アプリケーションを作っている場合は、何らかの入力フィールドがあるでしょう。

source: Acetate is great when it comes to prototyping input fields because it allows the user tester to write on the paper prototype non-permanently.
ja: アセテートフィルムはユーザーテスターがペーパープロトタイプに一時的に描き込むことができるので、入力フィールドのプロトタイプを作るのに最適です。

source: They can correct their mistakes and the writing can be quickly removed ready for the next test session.
ja: 間違いを修正したり、書いたものをすばやく消して次のテストセッションの準備をすることができます。

source: A Dry-Wipe Pen
ja: ホワイトボード用のペン

source: Naturally, you’ll need one of these for use with the acetate (see above).
ja: アセテートフィルムに書き込むときに使います。

source: This is not used in the construction of the prototype, but is needed in the testing described below.
ja: プロトタイプの作成では使用しませんが、次に説明するテストで必要になります。

source: Make sure the one you take to the test session has some ink in it!
ja: テストセッションの前にインクが残っていることを確認しましょう！

source: After adhering sticky tack to each corner of your component (1), you can place it on a larger, parent component (2).
ja: コンポーネントの四隅に粘着ラバーを貼り付けたら（1）、それを大きい親コンポーネントの上に配置します（2）。

source: You can always unstick it and move it later.
ja: 後からいつでもはがして移動できます。

source: Testing the Paper Prototype
ja: ペーパープロトタイプのテスト

source: Paper prototype testing is a slightly unusual ritual with a few things to remember and set up.
ja: ペーパープロトタイプのテストはやり方が少し独特で、いくつか覚えておくべきことがあり、セットアップも必要です。

source: Bring plenty of spares. A good session leads to fevered iteration.
ja: 予備を十分に用意する。良いテストセッションでは盛んなイテレーションが行われます。

source: Lots of spare paper and plenty of pens and scissors to go around are vital.
ja: 大量の予備の紙と、十分な量のペン、ハサミが欠かせません。

source: Write a scenario. Putting a user tester in front of your prototype cold will amount to stunned inaction.
ja: シナリオを書く。ユーザーテスターをいきなりプロトタイプの前に連れてきても、途方に暮れて何もできません。

source: Give them a scenario to work through, something the app should be able to solve for them.
ja: 彼らにこなすべきシナリオを与えましょう。アプリケーションを使って解決できるはずのことをやってもらうのです。

source: It’s important this scenario is fictional, and not drawn from the individual’s real experiences for the sake of privacy.
ja: このシナリオは架空のものであることが大切です。プライバシーに配慮して、個人の実体験を題材にしたものは避けます。

source: Appoint a computer. Someone who built the prototype will have to operate it.
ja: コンピュータ役を任命する。プロトタイプを作った人が、それを稼働させなければなりません。

source: That means reacting to (role-played) input by the user tester.
ja: つまり、ユーザーテスターによる（ロールプレイの）入力に反応するのです。

source: When the tester presses a button, for instance, the computer will have to reorganize the app in response.
ja: たとえば、テスターがボタンを押したら、コンピュータはそれに応じてアプリケーションを再編成する必要があります。

source: If the button deletes something this would mean unsticking the paper component and putting it to one side.
ja: ボタンが何かを消去したのなら、その紙のコンポーネントをはがして脇にどけるといった具合です。

source: Give clear instructions. Tell the user tester they can touch any items in the interface they think are interactive.
ja: 明確な指示を与える。ユーザーテスターに、インターフェイス内のインタラクティブだと思ったアイテムはどれでも触ってかまわないと伝えます。

source: Importantly, tell them to speak out loud what they are thinking as they use the prototype.
ja: 重要なのは、プロトタイプの使用中に考えていることを声に出して言うように指示することです。

source: This is important for understanding where there are usability failures and what needs to be overcome.
ja: これは、どこにユーザビリティの不具合があるかや、どんな問題を取り除く必要があるかを理解するうえで重要なことです。

source: Instill calm. It’s easy for the user to feel tested, so make it clear that you are not testing them but the app itself.
ja: ユーザーテスターを落ち着かせる。ユーザーは、自分が試されていると感じてしまいがちなので、これは彼らをテストしているのではなく、アプリケーションのテストだということをはっきりと伝えましょう。

source: If they don’t know how to operate it, make it clear in advance that it’s not their fault, but yours as the designer.
ja: 操作方法が分からなくても、それは彼らの落ち度ではなく、デザイナーのミスだと事前に言っておきます。

source: A T-shirt design I made for usability expert Lily Dart4 during her time consulting my former employer, Neontribe5.
ja: ユーザビリティのエキスパート、リリー・ダート（Lily Dart、http://lilydart.com/）のために私が作ったTシャツのデザイン。彼女が私の以前の勤め先であるNeontribe社（脚注129）のコンサルタントをしていたときのことです。

source: It bears her mantra, “Test usability, not users.”
ja: 「Test usability, not users.（ユーザーではなく、ユーザビリティをテストする）」というのは彼女のモットーです。

source: The Layout
ja: 配置

source: To give you a better picture of the testing setup, here’s an annotated sketch.
ja: テストのセットアップをイメージしやすくするために、注釈つきのイラストを用意しました。

source: The person playing the computer.
ja: コンピュータ役をする人。

source: A collection of prototype bits and pieces (other screens, yet-to-be-revealed functionality, etc.).
ja: プロトタイプのこまごまとしたパーツ（別の画面、まだ見えていない機能など）。

source: The app.
ja: アプリケーション。

source: The user tester, operating the prototype.
ja: プロトタイプを操作するユーザーテスター。

source: It’s often beneficial to have a passive second tester, sat with the user tester for moral support and to encourage dialogue.
ja: 操作には参加しないもう一人のテスターがいると効果的です。一緒に座っているだけでユーザーテスターは心強く感じ、会話が促されます。

source: A note taker.
ja: 記録係。

source: Notice the neutral seating position between the computer and testers.
ja: コンピュータとテスターの間という、中立的な位置に座っていることに注目してください。

source: By sitting here, between the two parties at either end, the testers should feel less scrutinized.
ja: 両者の間に座ることで、テスターは観察されていることをあまり意識しなくなります。

source: From Paper To Code
ja: 紙からコードへ

source: After a few sessions of paper prototype testing, you should have a lot of torn-up paper and a better idea of the app you should be building.
ja: ペーパープロトタイプでのテストを数セッション行った後は、はがされた紙片が山積みとなり、作るべきアプリケーションに対する理解が深まっているはずです。

source: The way you translate the surviving bits of paper into coded modules is critical for an inclusive end product.
ja: 生き残った紙片をコード化されたモジュールに変える方法は、インクルーシブな最終プロダクトにとって重要です。

source: It’s in the creation of your living styleguide6 that you should be drawing on the inclusive coding practices you’ve been learning in this book.
ja: 本書で学んできたインクルーシブなコーディング手法を活用して、生きたスタイルガイド（Living Style Guide）（脚注130）を作らなければなりません。

source: In a large team, this can be a collaborative effort with some friendly competition to reach the best solutions.
ja: 大規模なチームでは、他のメンバーと協力し、切磋琢磨しながらより良い解決策を導き出す作業になります。

source: In her article, “From Pages To Patterns: An Exercise For Everyone7,” Charlotte Jackson recommends that after agreeing on which components are which and what they should be named, you should get straight into coding.
ja: シャーロット・ジャクソン（Charlotte Jackson）は記事「From Pages To Patterns: An Exercise For Everyone」（脚注131）の中で、どのコンポーネントにどんな名前を付ければよいかが決まったら、コード化を始めるべきだと勧めています。

source: Charlotte sets it out simply, like this:
ja: シャーロットの提唱する方法は次のようにシンプルです。

source: •Everyone grab a component.
ja: • 各自が1つのコンポーネントを手に取る。

source: •Code it up in HTML and CSS.
ja: • それをHTMLとCSSでコード化する。

source: Set a time limit and resist the temptation to perfect things.
ja: 制限時間を設け、完璧を目指さないようにする。

source: It’s fine to throw away the code if the designs change.
ja: デザインが変更されたらコードを破棄してもかまわない。

source: •Compare and discuss your code.
ja: • 作成したコードを比較し、検討する。

source: •Repeat.
ja: • この作業を繰り返す。

source: I would suggest a couple of stipulations to really make the most of this in terms of inclusive design.
ja: インクルーシブという観点でこの作業を最も効果的に行うために、ここで2つの事を提案します。

source: First, I’d recommend several individuals (or teams) work on the same component so there are different solutions to compare.
ja: まず、さまざまな解決策を比較できるよう、数人（またはチーム）で同じコンポーネントに取り組むことをお勧めします。

source: Second, accessibility should be a prerequisite for consideration.
ja: 次に、アクセシビリティを検討や判断の前提条件にすべきです。

source: If a solution isn’t keyboard-accessible, uses a poor structure or is not explicable by screen reader, it’s out.
ja: キーボードでアクセスできない解決策や、不適切な構造している、スクリーンリーダーが理解できない、といった解決策ではいけません。

source: The quickest way to prototype in code is to use standard HTML elements such as <input>, <select>, <a> and <button>.
ja: プロトタイプを最も手早くコード化するには、<input>、<select>、<a>、<button>といった標準的なHTML要素を使います。

source: They give you the behaviors you need to make your component functional.
ja: コンポーネントを機能させるために必要な動作が得られます。

source: It’s usually only when we begin overengineering custom components that we encounter issues.
ja: 問題に直面するのはたいてい、カスタムのコンポーネントのオーバーエンジニアリングを行い始めたときです。

source: By going straight from paper to HTML, we lay the foundations for efficient code and inclusive experiences.
ja: 紙からHTMLへ一直線に進めれば、効率的なコードとインクルーシブな体験のための基礎を築くことができます。

source: It is based on this foundation that we can enrich the experience with CSS and JavaScript.
ja: この基礎をベースにし、CSSやJavaScriptを使って体験を向上させていきます。

source: After all, you can’t even have CSS or JavaScript without some HTML on which to stick them.
ja: 結局のところ、ベースとなるHTMLがなければ、そこに付加させるCSSやJavaScriptを使用することはできないのです。

source: So, you might as well get the HTML right first.
ja: ですから、まずはHTMLにしっかりと取り組みましょう。

source: 1.http://www.uxapprentice.com/discovery/ 2.https://greatbritishpublictoiletmap.rca.ac.uk/ 3.https://www.neontribe.co.uk/ 4.http://lilydart.com/ 5.https://www.neontribe.co.uk/ 6.https://www.smashingmagazine.com/2015/04/an-in-depth-overview-of-living-style-guide-tools/ 7.http://alistapart.com/article/from-pages-to-patterns-an-exercise-for-everyone
ja: 126 http://www.uxapprentice.com/discovery/ 127 https://greatbritishpublictoiletmap.rca.ac.uk/ 128 https://www.neontribe.co.uk/ 129 https://www.neontribe.co.uk/ 130 http://smashed.by/style-guide-tools 131 http://smashed.by/pages-to-patterns
